#Задача 3
k = int(input("Введите число K: "))
n = int(input("Введите число N: "))
q = n + 1
ses = 0
for x in range (k , q):


 print(x)