# Задача № 1
x = int(input("Введите первое число: "))
с = int(input("Введите первое число: "))

if x > c:
   print (c)
else:
   print (x)

