# Задача № 2
x = int(input("Введите число: "))


if 1000 < x < 10000:
   print ("YES")
else:
   print ("NO")

